cfg/Catalogs/СпособыОтраженияЗарплатыВРеглУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СпособыОтраженияЗарплатыВРеглУчете</Name>
			<Comment>(Регл)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДт1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДт2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДт3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзносыОсновногоНачисления</Name>
					<Comment>Особый способ отражения для ЕСВ ФОТ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВзносы</Name>
					<Comment>Есть проводка по взносам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСчетДтВзносы</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСубконтоДтВзносы1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСубконтоДтВзносы2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСубконтоДтВзносы3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатьяВаловыхРасходовВзносы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначениеДоНКУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяВаловыхРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначениеНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЕСВФОТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Catalogs/СпособыОтраженияЗарплатыВРеглУчете/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мСведенияОСчетах;  // для получения сведений о счетах на время работы формы
Перем мСведенияОСтатьяхЗатрат;  // для получения сведений о статьях затрат на время работы формы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ СправочникСписок

Процедура СправочникСписокСчетДтПриИзменении(Элемент)
	СведенияОСчете = БухгалтерскийУчет.ПолучитьСведенияОСчете(мСведенияОСчетах, Элемент.Значение);
	БухгалтерскийУчет.ПривестиЗначениеСубконто(ЭлементыФормы.СправочникСписок, "Дт", СведенияОСчете);
КонецПроцедуры

Процедура СправочникСписокСчетКтПриИзменении(Элемент)
	СведенияОСчете = БухгалтерскийУчет.ПолучитьСведенияОСчете(мСведенияОСчетах, Элемент.Значение);
	БухгалтерскийУчет.ПривестиЗначениеСубконто(ЭлементыФормы.СправочникСписок, "Кт", СведенияОСчете);
КонецПроцедуры

Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если НЕ ДанныеСтроки.ЭтоГруппа Тогда 
		СведенияОСчете = БухгалтерскийУчет.ПолучитьСведенияОСчете(мСведенияОСчетах, ДанныеСтроки.СчетДт);
		БухгалтерскийУчет.НазначитьВидимостьСубконто(ОформлениеСтроки, "Дт", СведенияОСчете);
		
		СведенияОСчете = БухгалтерскийУчет.ПолучитьСведенияОСчете(мСведенияОСчетах, ДанныеСтроки.СчетКт);
		БухгалтерскийУчет.НазначитьВидимостьСубконто(ОформлениеСтроки, "Кт", СведенияОСчете);
	КонецЕсли;
	НастройкаВидимостиНалоговыхНазначенийПоЗатратам(Элемент, ОформлениеСтроки, ДанныеСтроки);
	
КонецПроцедуры

Процедура НастройкаВидимостиНалоговыхНазначенийПоЗатратам(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ТипЗнч(ДанныеСтроки.СубконтоДт1) = Тип("СправочникСсылка.НоменклатурныеГруппы")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт1) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт1.НалоговоеНазначениеВПроизводстве;
	КонецЕсли;
	Если ТипЗнч(ДанныеСтроки.СубконтоДт2) = Тип("СправочникСсылка.НоменклатурныеГруппы")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт2) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт2.НалоговоеНазначениеВПроизводстве;
	КонецЕсли;	
	Если ТипЗнч(ДанныеСтроки.СубконтоДт3) = Тип("СправочникСсылка.НоменклатурныеГруппы")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт3) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт3.НалоговоеНазначениеВПроизводстве;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеСтроки.СубконтоДт1) = Тип("СправочникСсылка.ОбъектыСтроительства")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт1) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт1.НалоговоеНазначение;
	КонецЕсли;
	Если ТипЗнч(ДанныеСтроки.СубконтоДт2) = Тип("СправочникСсылка.ОбъектыСтроительства")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт2) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт2.НалоговоеНазначение;
	КонецЕсли;	
	Если ТипЗнч(ДанныеСтроки.СубконтоДт3) = Тип("СправочникСсылка.ОбъектыСтроительства")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт3) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт3.НалоговоеНазначение;
	КонецЕсли;

КонецПроцедуры




мСведенияОСчетах = Новый Соответствие;
мСведенияОСтатьяхЗатрат = Новый Соответствие;
